import asyncio

import random

from AnonX import app

from pyrogram.types import (InlineKeyboardButton,

                            InlineKeyboardMarkup, Message)

from strings.filters import command

from pyrogram import filters, Client





txt = [

"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏعامل الناس بأخلاقك ولا بأخلاقهم", 
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏالجمال يلفت الأنظار لكن الطيبه تلفت القلوب ", 
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏالاعتذار عن الأخطاء لا يجرح كرامتك بل يجعلك كبير في نظر الناس ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏلا ترجي السماحه من بخيل.. فما في البار لظمان ماء",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏلا تحقرون صغيره إن الجبال من الحصي",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏلا تستحي من إعطاء فإن الحرمان أقل منه ", 
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏلا تظلم حتى لا تتظلم ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏلا تقف قصاد الريح ولا تمشي معها ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏلا تكسب موده التحكم الا بالتعقل",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏلا تمد عينك في يد غيرك ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏلا تملح الا لمن يستحقاها ويحافظ عليها",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏلا حياه للإنسان بلا نبات",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏلا حياه في الرزق.. ولا شفاعه في الموت",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏكما تدين تدان",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏلا دين لمن لا عهد له ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏلا سلطان على الدوق فيما يحب أو بكره",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏلا مروه لمن لادين له ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏلا يدخل الجنه من لايأمن من جازه بوائقه",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏيسروا ولا تعسروا... ويشورا ولا تنفروا",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏيدهم الصدر ما يبني العقل الواسع ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏأثقل ما يوضع في الميزان يوم القيامة حسن الخلق ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏأجهل الناس من ترك يقين ما عنده لظن ما عند الناس ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏأحياناً.. ويصبح الوهم حقيقه ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏمينفعش تعاتب حد مبيعملش حساب لزعلك عشان متزعلش مرتين . ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏالسفر ومشاهده اماكن مختلفه وجديده ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏعدم تضيع الفرص واسثمارها لحظه مجبئها ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏ اعطاء الاخرين اكثر من ما يتوقعون",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏمعامله الناس بلطف ولكن عدم السماح لاحد بستغالال ذالك ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏتكوين صدقات جديده مع الحفظ بلاصدقاء القودامي ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏتعلم اصول المهنه بدلا من تضيع الوقت ف تعلم حيل المهنه ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏمدح ع الاقل ثلاث اشخاص يوميا ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏالنظر ف عيون الشخاص عند مخاطبتهم ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏالتحلي بلسماح مع الاخرين او النفس ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏالاكثار من قول كلمه شكرا ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏ مصافحه الاخرين بثبات وقوة ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏالابتعاد عن المناطق السيئه السمعه لتجنب الاحداث السئه ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏ ادخار 10٪ع الاقل من الدخل",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏ تجنب المخاوف من خلال التعلم من تجارب مختلفه",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏ الحفاظ ع السمعه لانها اغلي ما يملك الانسان",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏ تحويل الاعداء الي اصدقاء من خلال القيام بعمل جيد",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏلا تصدق كل ما تسمعع. ولا تنفق كل ما تمتلك . ولا تنم قدر ما ترغب ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏ اعتني بسمعتك جيدا فستثبت للك الايام انها اغلي ما تملك",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏحين تقول والدتك ستندم ع فعل ذالك ستندم عليه غالبا.. ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏ لا تخش العقبات الكبيره فخلفها تقع الفرص العظيمه",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏقد لا يتطلب الامر اكثر من شخص واحد لقلب حياتك رأس ع عقب ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏاختر رفيقه حياتك بحرص فهو قرار سيشكل 90٪من سعادتك او بؤسك ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏاقلب اداءك الاصدقاء بفعل شي جميل ومفجائ لهم",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏحين تدق الفرصه ع باباك ادعوها للبيت ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏتعلم القواعد جيدا ثن اكسر بعدها ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏاحكم ع نجاحك من خلال قدرتك ع العطاء وليس الاخذ ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏ لا تتجاهل الشيطان مهما بدل ثيابه",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏركز ع جعل الاشياء افضل وليس اكبر او اعظم ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏكن سعيد  بما تمتلك واعمل لامتلاك ما تريد ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏاعط الناس اكثر من ما يتوقعون ",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏ لا تكن منشغل لدرجه عدم التعرف ع اصدقاء جدد",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏاستحمه يوم العيد يمعفن🤓",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏمش تحب اي حد يقرب منك ",
" \n ᴅᴇᴠ ᴡʜɪsᴋᴇʏخليك مع البت راجل خليك تقيل🥥",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏ انصح نفسك بنفسك بمت😆",
"\n ᴅᴇᴠ ᴡʜɪsᴋᴇʏ كنت نصحت نفسي ياخويا😹", 

        ]


        


@app.on_message(command(["انصحني","حياه انصحيني"]))

async def anshny(client: Client, message: Message):

      a = random.choice(txt)

      await message.reply(

        f"{a}")