import asyncio

import random

from AnonX import app

from pyrogram.types import (InlineKeyboardButton,

                            InlineKeyboardMarkup, Message)

from strings.filters import command

from pyrogram import filters, Client





txt = [

"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nعامل الناس بأخلاقك ولا بأخلاقهم", 
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nالجمال يلفت الأنظار لكن الطيبه تلفت القلوب ", 
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nالاعتذار عن الأخطاء لا يجرح كرامتك بل يجعلك كبير في نظر الناس ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nلا ترجي السماحه من بخيل.. فما في البار لظمان ماء",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nلا تحقرون صغيره إن الجبال من الحصي",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nلا تستحي من إعطاء فإن الحرمان أقل منه ", 
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nلا تظلم حتى لا تتظلم ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nلا تقف قصاد الريح ولا تمشي معها ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nلا تكسب موده التحكم الا بالتعقل",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nلا تمد عينك في يد غيرك ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nلا تملح الا لمن يستحقاها ويحافظ عليها",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nلا حياه للإنسان بلا نبات",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nلا حياه في الرزق.. ولا شفاعه في الموت",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nكما تدين تدان",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nلا دين لمن لا عهد له ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nلا سلطان على الدوق فيما يحب أو بكره",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nلا مروه لمن لادين له ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nلا يدخل الجنه من لايأمن من جازه بوائقه",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nيسروا ولا تعسروا... ويشورا ولا تنفروا",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nيدهم الصدر ما يبني العقل الواسع ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nأثقل ما يوضع في الميزان يوم القيامة حسن الخلق ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nأجهل الناس من ترك يقين ما عنده لظن ما عند الناس ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nأحياناً.. ويصبح الوهم حقيقه ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nمينفعش تعاتب حد مبيعملش حساب لزعلك عشان متزعلش مرتين . ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nالسفر ومشاهده اماكن مختلفه وجديده ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nعدم تضيع الفرص واسثمارها لحظه مجبئها ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\n اعطاء الاخرين اكثر من ما يتوقعون",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nمعامله الناس بلطف ولكن عدم السماح لاحد بستغالال ذالك ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nتكوين صدقات جديده مع الحفظ بلاصدقاء القودامي ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nتعلم اصول المهنه بدلا من تضيع الوقت ف تعلم حيل المهنه ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nمدح ع الاقل ثلاث اشخاص يوميا ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nالنظر ف عيون الشخاص عند مخاطبتهم ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nالتحلي بلسماح مع الاخرين او النفس ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nالاكثار من قول كلمه شكرا ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\n مصافحه الاخرين بثبات وقوة ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nالابتعاد عن المناطق السيئه السمعه لتجنب الاحداث السئه ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\n ادخار 10٪ع الاقل من الدخل",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\n تجنب المخاوف من خلال التعلم من تجارب مختلفه",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\n الحفاظ ع السمعه لانها اغلي ما يملك الانسان",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\n تحويل الاعداء الي اصدقاء من خلال القيام بعمل جيد",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nلا تصدق كل ما تسمعع. ولا تنفق كل ما تمتلك . ولا تنم قدر ما ترغب ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\n اعتني بسمعتك جيدا فستثبت للك الايام انها اغلي ما تملك",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nحين تقول والدتك ستندم ع فعل ذالك ستندم عليه غالبا.. ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\n لا تخش العقبات الكبيره فخلفها تقع الفرص العظيمه",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nقد لا يتطلب الامر اكثر من شخص واحد لقلب حياتك رأس ع عقب ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nاختر رفيقه حياتك بحرص فهو قرار سيشكل 90٪من سعادتك او بؤسك ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nاقلب اداءك الاصدقاء بفعل شي جميل ومفجائ لهم",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nحين تدق الفرصه ع باباك ادعوها للبيت ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nتعلم القواعد جيدا ثن اكسر بعدها ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nاحكم ع نجاحك من خلال قدرتك ع العطاء وليس الاخذ ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\n لا تتجاهل الشيطان مهما بدل ثيابه",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nركز ع جعل الاشياء افضل وليس اكبر او اعظم ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nكن سعيد  بما تمتلك واعمل لامتلاك ما تريد ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nاعط الناس اكثر من ما يتوقعون ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\n لا تكن منشغل لدرجه عدم التعرف ع اصدقاء جدد",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nاستحمه يوم العيد يمعفن🤓",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nمش تحب اي حد يقرب منك ",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\nخليك مع البت راجل خليك تقيل🥥",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\n انصح نفسك بنفسك بمت😆",
"ᴅᴇᴠ ᴡʜɪsᴋᴇʏ\n كنت نصحت نفسي ياخويا😹", 

        ]


        


@app.on_message(command(["انصحني","حياه انصحيني"]))

async def anshny(client: Client, message: Message):

      a = random.choice(txt)

      await message.reply(

        f"{a}")
